<script setup lang="ts">

</script>

<template>
  <div class="flex-wrapper justify-center">
    <div class="container" style="font-size: 18px">
      <h2 style="margin-top: 12px">Для кого</h2>
      <p>
        Это страница для технических специалистов. Здесь мы оставили краткое описаниие технологий,
        чтобы вам не пришлось далеко ходить за презентацией.
      </p>

      <h2 class="font-bold">
        Пайплан потока данных выглядит так:
      </h2>

      <ul class="ml-12 mt-6">
        <li>
          Processing Service приходит в папку с файлами и проверяет наличие новых данных. Если они есть, то он
          конвертирует их в pdf и отправляет в модель. Благодаря ProcessingService, мы можем работать с разными данными:
          фотографиями, презентациями, word и pdf-документами. Мы специально вынесли Processing Service отдельно,
          чтобы разместить его на свободном сервере и не грузить систему.
        </li>

        <li>
          После конвертации данных, Vision LLM Service делает основную работу: создает вектора, индексирует данные, осуществяет поиск.
          Это ядро проекта.
        </li>
        <li>
          Дальше все просто: фронтенд вызывает бекенд, бекенд вызывает Vision LLM Service. Данные
          идут в обратном порядке.
        </li>
      </ul>

      <img
          src="../assets/pipe.jpg"
          alt=""
          style="max-width: 100%"
          class="mt-24"
      />
      <h2 class="mt-24">Что использовали</h2>
      <ul class="ml-12 mt-6">
        <li>
          Чтобы быстрее обрабатывать pdf-файлы с сотнями страниц внутри, мы применили PyTorch, numpy, PyPdf2.
          Это увеличило скорость обработки на 15%.
        </li>
        <li>
          Мы экспериментировали с параметрами модели Llama 3.1 и оптимизировали работу с векторами. В частности,
          мы рассматривали разные варианты LLAMA от 2 до 3 версии, от 1B до 8B, от обычных до instruct.
        </li>
        <li>
          Мы подключили дополнительные библиотеки из пакетов ColPali и Byaldi, чтобы предварительно обрабатывать
          графические данные. Такая предварительная обработка помогла улучшить их качество.
        </li>
      </ul>

      <h2>Остались вопросы?</h2>
      <p>
        Пишите <a href="https://t.me/iyufedotov" target="_blank">капитану</a>
      </p>
      <p class="mt-48">С наилучшими пожеланиями,</p>
      <p>Команда "Альянс"</p>

    </div>

  </div>
</template>

<style scoped>
.container {
  max-width: 1200px;
  width: 100%;
  background: white;
  margin: 48px;
  padding: 6px 12px;
}

h2{
  margin-top: 36px;
}

li{
  margin-top: 12px;
}
</style>